betaflight/betaflight/src/platform/STM32/bus_spi_ll.c
/*
 * This file is part of Cleanflight and Betaflight.
 *
 * Cleanflight and Betaflight are free software. You can redistribute
 * this software and/or modify this software under the terms of the
 * GNU General Public License as published by the Free Software
 * Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * Cleanflight and Betaflight are distributed in the hope that they
 * will be useful, but WITHOUT ANY WARRANTY; without even the implied
 * warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this software.
 *
 * If not, see <http://www.gnu.org/licenses/>.
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "platform.h"

#if defined(USE_SPI)

#include "common/utils.h"
#include "common/maths.h"

#include "drivers/bus.h"
#include "drivers/bus_spi_types.h"
#include "drivers/bus_spi.h"
#include "drivers/bus_spi_impl.h"
#include "drivers/dma.h"
#include "platform/dma.h"
#include "drivers/io.h"
#include "platform/rcc.h"
#if SPI_TRAIT_HANDLE
#include "platform/bus_spi_hal.h"
#endif

// Use DMA if possible if this many bytes are to be transferred
#define SPI_DMA_THRESHOLD 8

#ifndef SPI1_NSS_PIN
#define SPI1_NSS_PIN NONE
#endif
#ifndef SPI2_NSS_PIN
#define SPI2_NSS_PIN NONE
#endif
#ifndef SPI3_NSS_PIN
#define SPI3_NSS_PIN NONE
#endif
#ifndef SPI4_NSS_PIN
#define SPI4_NSS_PIN NONE
#endif

#define SPI_DEFAULT_TIMEOUT 10

#ifdef STM32H7
#define IS_DTCM(p) (((uint32_t)p & 0xfffe0000) == 0x20000000)
#elif defined(STM32F7)
#define IS_DTCM(p) (((uint32_t)p & 0xffff0000) == 0x20000000)
#elif defined(STM32G4)
#define IS_CCM(p) ((((uint32_t)p & 0xffff8000) == 0x10000000) || (((uint32_t)p & 0xffff8000) == 0x20018000))
#elif defined(STM32H5)
// H5 has no DTCM/CCM restrictions for DMA
#define IS_DTCM(p) (0)
#elif defined(STM32N6)
// N6 has no DTCM/CCM restrictions for DMA
#define IS_DTCM(p) (0)
#endif
#if SPI_TRAIT_HANDLE
static struct spiHalHandle_s spiHalHandles[SPIDEV_COUNT];
#endif

static LL_SPI_InitTypeDef defaultInit =
{
    .TransferDirection = LL_SPI_FULL_DUPLEX,
    .Mode = LL_SPI_MODE_MASTER,
    .DataWidth = LL_SPI_DATAWIDTH_8BIT,
    .NSS = LL_SPI_NSS_SOFT,
    .BaudRate = LL_SPI_BAUDRATEPRESCALER_DIV8,
    .BitOrder = LL_SPI_MSB_FIRST,
    .CRCCalculation = LL_SPI_CRCCALCULATION_DISABLE,
    .ClockPolarity = LL_SPI_POLARITY_HIGH,
    .ClockPhase = LL_SPI_PHASE_2EDGE,
};

static uint32_t spiDivisorToBRbits(const SPI_TypeDef *instance, uint16_t divisor)
{
#if defined(STM32F7)
    /* On F7 we run SPI2 and SPI3 (on the APB1 bus) at a division of PCLK1 which is
     * half that of HCLK driving the APB2 bus and SPI1. So we need to reduce the
     * division factors for SPI2/3 by a corresponding factor of 2.
     */
    if (instance == SPI2 || instance == SPI3) {
        divisor /= 2; // Safe for divisor == 0 or 1
    }
#else
    // On the G4 and H7 processors the SPI busses are all derived from the same base frequency
    UNUSED(instance);
#endif

    divisor = constrain(divisor, 2, 256);

#if defined(STM32H7) || defined(STM32H5) || defined(STM32N6)
    const uint32_t baudRatePrescaler[8] = {
        LL_SPI_BAUDRATEPRESCALER_DIV2,
        LL_SPI_BAUDRATEPRESCALER_DIV4,
        LL_SPI_BAUDRATEPRESCALER_DIV8,
        LL_SPI_BAUDRATEPRESCALER_DIV16,
        LL_SPI_BAUDRATEPRESCALER_DIV32,
        LL_SPI_BAUDRATEPRESCALER_DIV64,
        LL_SPI_BAUDRATEPRESCALER_DIV128,
        LL_SPI_BAUDRATEPRESCALER_DIV256,
    };
    int prescalerIndex = ffs(divisor) - 2; // prescaler begins at "/2"

    return baudRatePrescaler[prescalerIndex];
#else
    return (ffs(divisor) - 2) << SPI_CR1_BR_Pos;
#endif
}

void spiInitDevice(spiDevice_e device)
{
    spiDevice_t *spi = &spiDevice[device];

    if (!spi->dev) {
        return;
    }

#if SPI_TRAIT_HANDLE
    spi->halHandle = &spiHalHandles[device];
#endif

    SPI_TypeDef *dev = (SPI_TypeDef *)spi->dev;

    // Enable SPI clock
    RCC_ClockCmd(spi->rcc, ENABLE);
    RCC_ResetCmd(spi->rcc, ENABLE);

    IOInit(IOGetByTag(spi->sck),  OWNER_SPI_SCK, RESOURCE_INDEX(device));
    IOInit(IOGetByTag(spi->miso), OWNER_SPI_SDI, RESOURCE_INDEX(device));
    IOInit(IOGetByTag(spi->mosi), OWNER_SPI_SDO, RESOURCE_INDEX(device));

    IOConfigGPIOAF(IOGetByTag(spi->miso), SPI_IO_AF_SDI_CFG, spi->misoAF);
    IOConfigGPIOAF(IOGetByTag(spi->mosi), SPI_IO_AF_CFG, spi->mosiAF);
    IOConfigGPIOAF(IOGetByTag(spi->sck), SPI_IO_AF_SCK_CFG_HIGH, spi->sckAF);

    LL_SPI_Disable(dev);
    LL_SPI_DeInit(dev);

#if defined(STM32H5) || defined(STM32H7) || defined(STM32N6)
    // Prevent glitching when SPI is disabled
    LL_SPI_EnableGPIOControl(dev);

    LL_SPI_SetFIFOThreshold(dev, LL_SPI_FIFO_TH_01DATA);
    LL_SPI_Init(dev, &defaultInit);
#else
    LL_SPI_SetRxFIFOThreshold(dev, SPI_RXFIFO_THRESHOLD_QF);

    LL_SPI_Init(dev, &defaultInit);
    LL_SPI_Enable(dev);
#endif
}

void spiInternalResetDescriptors(busDevice_t *bus)
{
#if defined(STM32H5)
    SPI_TypeDef *instance = (SPI_TypeDef *)bus->busType_u.spi.instance;
    LL_DMA_InitTypeDef *dmaInitTx = bus->dmaInitTx;

    memset(dmaInitTx, 0, sizeof(*dmaInitTx));
    dmaInitTx->Request = bus->dmaTx->channel;
    dmaInitTx->BlkHWRequest = LL_DMA_HWREQUEST_SINGLEBURST;
    dmaInitTx->Direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
    dmaInitTx->SrcIncMode = LL_DMA_SRC_INCREMENT;
    dmaInitTx->DestIncMode = LL_DMA_DEST_FIXED;
    dmaInitTx->SrcDataWidth = LL_DMA_SRC_DATAWIDTH_BYTE;
    dmaInitTx->DestDataWidth = LL_DMA_DEST_DATAWIDTH_BYTE;
    dmaInitTx->SrcBurstLength = 1;
    dmaInitTx->DestBurstLength = 1;
    dmaInitTx->Priority = LL_DMA_LOW_PRIORITY_LOW_WEIGHT;
    dmaInitTx->DataAlignment = LL_DMA_DATA_ALIGN_ZEROPADD;
    dmaInitTx->Mode = LL_DMA_NORMAL;
    dmaInitTx->DestAddress = (uint32_t)&instance->TXDR;

    if (bus->dmaRx) {
        LL_DMA_InitTypeDef *dmaInitRx = bus->dmaInitRx;

        memset(dmaInitRx, 0, sizeof(*dmaInitRx));
        dmaInitRx->Request = bus->dmaRx->channel;
        dmaInitRx->BlkHWRequest = LL_DMA_HWREQUEST_SINGLEBURST;
        dmaInitRx->Direction = LL_DMA_DIRECTION_PERIPH_TO_MEMORY;
        dmaInitRx->SrcIncMode = LL_DMA_SRC_FIXED;
        dmaInitRx->DestIncMode = LL_DMA_DEST_INCREMENT;
        dmaInitRx->SrcDataWidth = LL_DMA_SRC_DATAWIDTH_BYTE;
        dmaInitRx->DestDataWidth = LL_DMA_DEST_DATAWIDTH_BYTE;
        dmaInitRx->SrcBurstLength = 1;
        dmaInitRx->DestBurstLength = 1;
        dmaInitRx->Priority = LL_DMA_LOW_PRIORITY_MID_WEIGHT;
        dmaInitRx->DataAlignment = LL_DMA_DATA_ALIGN_ZEROPADD;
        dmaInitRx->Mode = LL_DMA_NORMAL;
        dmaInitRx->SrcAddress = (uint32_t)&instance->RXDR;
    }
#elif defined(STM32N6)
    // TODO: GPDMA uses a completely different LL_DMA API; SPI DMA not yet supported
    UNUSED(bus);
#else
    SPI_TypeDef *instance = (SPI_TypeDef *)bus->busType_u.spi.instance;
    LL_DMA_InitTypeDef *dmaInitTx = bus->dmaInitTx;

#if defined(STM32H7)
    if (IS_BDMA_DESCRIPTOR(bus->dmaTx)) {
        // BDMA channel-based init for D3 domain peripherals (e.g., SPI6)
        memset(dmaInitTx, 0, sizeof(*dmaInitTx));
        dmaInitTx->PeriphRequest = bus->dmaTx->channel;
        dmaInitTx->Direction = LL_BDMA_DIRECTION_MEMORY_TO_PERIPH;
        dmaInitTx->PeriphOrM2MSrcAddress = (uint32_t)&instance->TXDR;

