betaflight/betaflight/src/platform/STM32/bus_spi_ll.c
        if (bus->dmaRx) {
            LL_DMA_InitTypeDef *dmaInitRx = bus->dmaInitRx;
            memset(dmaInitRx, 0, sizeof(*dmaInitRx));
            dmaInitRx->PeriphRequest = bus->dmaRx->channel;
            dmaInitRx->PeriphOrM2MSrcAddress = (uint32_t)&instance->RXDR;
            dmaInitRx->Priority = LL_BDMA_PRIORITY_MEDIUM;
        }
        return;
    }
#endif

    LL_DMA_StructInit(dmaInitTx);
#if defined(STM32G4) || defined(STM32H7)
    dmaInitTx->PeriphRequest = bus->dmaTx->channel;
#else
    dmaInitTx->Channel = bus->dmaTx->channel;
#endif
    dmaInitTx->Mode = LL_DMA_MODE_NORMAL;
    dmaInitTx->Direction = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
#if defined(STM32H7)
    dmaInitTx->PeriphOrM2MSrcAddress = (uint32_t)&instance->TXDR;
#else
    dmaInitTx->PeriphOrM2MSrcAddress = (uint32_t)&instance->DR;
#endif
    dmaInitTx->Priority = LL_DMA_PRIORITY_LOW;
    dmaInitTx->PeriphOrM2MSrcIncMode  = LL_DMA_PERIPH_NOINCREMENT;
    dmaInitTx->PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_BYTE;
    dmaInitTx->MemoryOrM2MDstDataSize = LL_DMA_MDATAALIGN_BYTE;

    if (bus->dmaRx) {
        LL_DMA_InitTypeDef *dmaInitRx = bus->dmaInitRx;

        LL_DMA_StructInit(dmaInitRx);
#if defined(STM32G4) || defined(STM32H7)
        dmaInitRx->PeriphRequest = bus->dmaRx->channel;
#else
        dmaInitRx->Channel = bus->dmaRx->channel;
#endif
        dmaInitRx->Mode = LL_DMA_MODE_NORMAL;
        dmaInitRx->Direction = LL_DMA_DIRECTION_PERIPH_TO_MEMORY;
#if defined(STM32H7)
        dmaInitRx->PeriphOrM2MSrcAddress = (uint32_t)&instance->RXDR;
#else
        dmaInitRx->PeriphOrM2MSrcAddress = (uint32_t)&instance->DR;
#endif
        dmaInitRx->Priority = LL_DMA_PRIORITY_MEDIUM;
        dmaInitRx->PeriphOrM2MSrcIncMode  = LL_DMA_PERIPH_NOINCREMENT;
        dmaInitRx->PeriphOrM2MSrcDataSize = LL_DMA_PDATAALIGN_BYTE;
    }
#endif // !STM32N6
}

void spiInternalResetStream(dmaChannelDescriptor_t *descriptor)
{
    // Disable the stream
#if defined(STM32G4) || defined(STM32H5) || defined(STM32N6)
    LL_DMA_DisableChannel(descriptor->dma, descriptor->stream);
    while (LL_DMA_IsEnabledChannel(descriptor->dma, descriptor->stream));
#else
#if defined(STM32H7)
    if (IS_BDMA_DESCRIPTOR(descriptor)) {
        LL_BDMA_DisableChannel(descriptor->dma, descriptor->stream);
        while (LL_BDMA_IsEnabledChannel(descriptor->dma, descriptor->stream));
    } else
#endif
    {
        LL_DMA_DisableStream(descriptor->dma, descriptor->stream);
        while (LL_DMA_IsEnabledStream(descriptor->dma, descriptor->stream));
    }
#endif

    // Clear any pending interrupt flags
    DMA_CLEAR_FLAG(descriptor, DMA_IT_HTIF | DMA_IT_TEIF | DMA_IT_TCIF);
}

FAST_CODE bool spiInternalReadWriteBufPolled(spiResource_t *spiInstance, const uint8_t *txData, uint8_t *rxData, int len)
{
    SPI_TypeDef *instance = (SPI_TypeDef *)spiInstance;
#if defined(STM32H7) || defined(STM32H5) || defined(STM32N6)
    LL_SPI_SetTransferSize(instance, len);
    LL_SPI_Enable(instance);
    LL_SPI_StartMasterTransfer(instance);
    while (len) {
        while (!LL_SPI_IsActiveFlag_TXP(instance));
        uint8_t b = txData ? *(txData++) : 0xFF;
        LL_SPI_TransmitData8(instance, b);

        while (!LL_SPI_IsActiveFlag_RXP(instance));
        b = LL_SPI_ReceiveData8(instance);
        if (rxData) {
            *(rxData++) = b;
        }
        --len;
    }
    while (!LL_SPI_IsActiveFlag_EOT(instance));
    LL_SPI_ClearFlag_TXTF(instance);
    LL_SPI_Disable(instance);
#else
    // set 16-bit transfer
    CLEAR_BIT(instance->CR2, SPI_RXFIFO_THRESHOLD);
    while (len > 1) {
        while (!LL_SPI_IsActiveFlag_TXE(instance));
        uint16_t w;
        if (txData) {
            w = *((uint16_t *)txData);
            txData += 2;
        } else {
            w = 0xFFFF;
        }
        LL_SPI_TransmitData16(instance, w);

        while (!LL_SPI_IsActiveFlag_RXNE(instance));
        w = LL_SPI_ReceiveData16(instance);
        if (rxData) {
            *((uint16_t *)rxData) = w;
            rxData += 2;
        }
        len -= 2;
    }
    // set 8-bit transfer
    SET_BIT(instance->CR2, SPI_RXFIFO_THRESHOLD);
    if (len) {
        while (!LL_SPI_IsActiveFlag_TXE(instance));
        uint8_t b = txData ? *(txData++) : 0xFF;
        LL_SPI_TransmitData8(instance, b);

        while (!LL_SPI_IsActiveFlag_RXNE(instance));
        b = LL_SPI_ReceiveData8(instance);
        if (rxData) {
            *(rxData++) = b;
        }
        --len;
    }
#endif

    return true;
}

void spiInternalInitStream(const extDevice_t *dev, volatile busSegment_t *segment)
{
#if defined(STM32H5)
    STATIC_DMA_DATA_AUTO uint8_t dummyTxByte = 0xff;
    STATIC_DMA_DATA_AUTO uint8_t dummyRxByte;
    busDevice_t *bus = dev->bus;
    int len = segment->len;

    uint8_t *txData = segment->u.buffers.txData;
    LL_DMA_InitTypeDef *dmaInitTx = bus->dmaInitTx;

    if (txData) {
        dmaInitTx->SrcAddress = (uint32_t)txData;
        dmaInitTx->SrcIncMode = LL_DMA_SRC_INCREMENT;
    } else {
        dmaInitTx->SrcAddress = (uint32_t)&dummyTxByte;
        dmaInitTx->SrcIncMode = LL_DMA_SRC_FIXED;
    }
    dmaInitTx->BlkDataLength = len;

    uint8_t *rxData = segment->u.buffers.rxData;
    LL_DMA_InitTypeDef *dmaInitRx = bus->dmaInitRx;

    if (rxData) {
        dmaInitRx->DestAddress = (uint32_t)rxData;
        dmaInitRx->DestIncMode = LL_DMA_DEST_INCREMENT;
    } else {
        dmaInitRx->DestAddress = (uint32_t)&dummyRxByte;
        dmaInitRx->DestIncMode = LL_DMA_DEST_FIXED;
    }
    dmaInitRx->BlkDataLength = len;
#elif defined(STM32N6)
    // TODO: GPDMA uses a completely different LL_DMA API; SPI DMA not yet supported
    UNUSED(dev);
    UNUSED(segment);
#else
    STATIC_DMA_DATA_AUTO uint8_t dummyTxByte = 0xff;
    STATIC_DMA_DATA_AUTO uint8_t dummyRxByte;
    busDevice_t *bus = dev->bus;
    int len = segment->len;

    uint8_t *txData = segment->u.buffers.txData;
    LL_DMA_InitTypeDef *dmaInitTx = bus->dmaInitTx;

#if defined(STM32H7)
    if (IS_BDMA_DESCRIPTOR(bus->dmaTx)) {
        // BDMA path: no cache ops needed (SRAM4 is not cached)
        static BDMA_RAM uint8_t bdmaDummyTxByte;
        static BDMA_RAM uint8_t bdmaDummyRxByte;

        if (txData) {
            dmaInitTx->MemoryOrM2MDstAddress = (uint32_t)txData;
            dmaInitTx->MemoryOrM2MDstIncMode = LL_BDMA_MEMORY_INCREMENT;
        } else {
            bdmaDummyTxByte = 0xff;
            dmaInitTx->MemoryOrM2MDstAddress = (uint32_t)&bdmaDummyTxByte;
            dmaInitTx->MemoryOrM2MDstIncMode = LL_BDMA_MEMORY_NOINCREMENT;
        }
        dmaInitTx->NbData = len;

        uint8_t *rxData = segment->u.buffers.rxData;
        LL_DMA_InitTypeDef *dmaInitRx = bus->dmaInitRx;

