betaflight/betaflight/src/platform/STM32/bus_spi_ll.c
        if (rxData) {
            dmaInitRx->MemoryOrM2MDstAddress = (uint32_t)rxData;
            dmaInitRx->MemoryOrM2MDstIncMode = LL_BDMA_MEMORY_INCREMENT;
        } else {
            dmaInitRx->MemoryOrM2MDstAddress = (uint32_t)&bdmaDummyRxByte;
            dmaInitRx->MemoryOrM2MDstIncMode = LL_BDMA_MEMORY_NOINCREMENT;
        }
        dmaInitRx->NbData = len;
        return;
    }
#endif

    if (txData) {
#ifdef __DCACHE_PRESENT
#ifdef STM32H7
        if ((txData < &_dmaram_start__) || (txData >= &_dmaram_end__)) {
#else
        // No need to flush DTCM memory
        if (!IS_DTCM(txData)) {
#endif
            // Flush the D cache to ensure the data to be written is in main memory
            SCB_CleanDCache_by_Addr(
                    (uint32_t *)((uint32_t)txData & ~CACHE_LINE_MASK),
                    (((uint32_t)txData & CACHE_LINE_MASK) + len - 1 + CACHE_LINE_SIZE) & ~CACHE_LINE_MASK);
        }
#endif // __DCACHE_PRESENT
        dmaInitTx->MemoryOrM2MDstAddress = (uint32_t)txData;
        dmaInitTx->MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT;
    } else {
        dmaInitTx->MemoryOrM2MDstAddress = (uint32_t)&dummyTxByte;
        dmaInitTx->MemoryOrM2MDstIncMode = LL_DMA_MEMORY_NOINCREMENT;
    }
    dmaInitTx->NbData = len;

#if !defined(STM32G4) && !defined(STM32H7)
    if (dev->bus->dmaRx) {
#endif
        uint8_t *rxData = segment->u.buffers.rxData;
        LL_DMA_InitTypeDef *dmaInitRx = bus->dmaInitRx;

        if (rxData) {
            /* Flush the D cache for the start and end of the receive buffer as
             * the cache will be invalidated after the transfer and any valid data
             * just before/after must be in memory at that point
             */
#ifdef __DCACHE_PRESENT
            // No need to flush/invalidate DTCM memory
#ifdef STM32H7
            if ((rxData < &_dmaram_start__) || (rxData >= &_dmaram_end__)) {
#else
            // No need to flush DTCM memory
            if (!IS_DTCM(rxData)) {
#endif
                SCB_CleanInvalidateDCache_by_Addr(
                        (uint32_t *)((uint32_t)rxData & ~CACHE_LINE_MASK),
                        (((uint32_t)rxData & CACHE_LINE_MASK) + len - 1 + CACHE_LINE_SIZE) & ~CACHE_LINE_MASK);
            }
#endif // __DCACHE_PRESENT
        dmaInitRx->MemoryOrM2MDstAddress = (uint32_t)rxData;
        dmaInitRx->MemoryOrM2MDstIncMode = LL_DMA_MEMORY_INCREMENT;
    } else {
        dmaInitRx->MemoryOrM2MDstAddress = (uint32_t)&dummyRxByte;
        dmaInitRx->MemoryOrM2MDstIncMode = LL_DMA_MEMORY_NOINCREMENT;
    }
    dmaInitRx->NbData = len;
#if !defined(STM32G4) && !defined(STM32H7)
    }
#endif
#endif // !STM32N6
}

void spiInternalStartDMA(const extDevice_t *dev)
{
#if defined(STM32H5)
    busDevice_t *bus = dev->bus;
    SPI_TypeDef *instance = (SPI_TypeDef *)bus->busType_u.spi.instance;

    dmaChannelDescriptor_t *dmaTx = bus->dmaTx;
    dmaChannelDescriptor_t *dmaRx = bus->dmaRx;

    // Use the correct callback argument
    dmaRx->userParam = (uint32_t)dev;

    // Clear transfer flags
    DMA_CLEAR_FLAG(dmaTx, DMA_IT_HTIF | DMA_IT_TEIF | DMA_IT_TCIF);
    DMA_CLEAR_FLAG(dmaRx, DMA_IT_HTIF | DMA_IT_TEIF | DMA_IT_TCIF);

    // Disable channels to enable update
    LL_DMA_DisableChannel(dmaTx->dma, dmaTx->stream);
    LL_DMA_DisableChannel(dmaRx->dma, dmaRx->stream);

    // Use the Rx interrupt as this occurs once the SPI operation is complete
    LL_DMA_EnableIT_TC(dmaRx->dma, dmaRx->stream);

    // Update channels
    LL_DMA_Init(dmaTx->dma, dmaTx->stream, bus->dmaInitTx);
    LL_DMA_Init(dmaRx->dma, dmaRx->stream, bus->dmaInitRx);

    // Setup SPI transfer size, enable DMA channels, then SPI
    LL_SPI_SetTransferSize(instance, dev->bus->curSegment->len);
    LL_DMA_EnableChannel(dmaTx->dma, dmaTx->stream);
    LL_DMA_EnableChannel(dmaRx->dma, dmaRx->stream);
    SET_BIT(instance->CFG1, SPI_CFG1_RXDMAEN | SPI_CFG1_TXDMAEN);
    LL_SPI_Enable(instance);
    LL_SPI_StartMasterTransfer(instance);
#elif defined(STM32N6)
    // TODO: GPDMA uses a completely different API; SPI DMA not yet supported
    UNUSED(dev);
#else
    busDevice_t *bus = dev->bus;
    SPI_TypeDef *instance = (SPI_TypeDef *)bus->busType_u.spi.instance;

    dmaChannelDescriptor_t *dmaTx = bus->dmaTx;
    dmaChannelDescriptor_t *dmaRx = bus->dmaRx;

#if defined(STM32H7)
    if (IS_BDMA_DESCRIPTOR(bus->dmaTx)) {
        // BDMA channel-based DMA for D3 domain peripherals (e.g., SPI6)
        dmaRx->userParam = (uint32_t)dev;

        DMA_CLEAR_FLAG(dmaTx, DMA_IT_HTIF | DMA_IT_TEIF | DMA_IT_TCIF);
        DMA_CLEAR_FLAG(dmaRx, DMA_IT_HTIF | DMA_IT_TEIF | DMA_IT_TCIF);

        BDMA_Channel_TypeDef *channelRegsRx = (BDMA_Channel_TypeDef *)dmaRx->ref;

        // Disable channels to enable update
        ((BDMA_Channel_TypeDef *)dmaTx->ref)->CCR = 0U;
        channelRegsRx->CCR = 0U;

        // Use the Rx interrupt as this occurs once the SPI operation is complete
        LL_EX_BDMA_EnableIT_TC(channelRegsRx);

        // Update channels
        LL_BDMA_Init(dmaTx->dma, dmaTx->stream, (LL_BDMA_InitTypeDef *)bus->dmaInitTx);
        LL_BDMA_Init(dmaRx->dma, dmaRx->stream, (LL_BDMA_InitTypeDef *)bus->dmaInitRx);

        // Enable SPI DMA
        LL_SPI_SetTransferSize(instance, dev->bus->curSegment->len);
        LL_BDMA_EnableChannel(dmaTx->dma, dmaTx->stream);
        LL_BDMA_EnableChannel(dmaRx->dma, dmaRx->stream);
        SET_BIT(instance->CFG1, SPI_CFG1_RXDMAEN | SPI_CFG1_TXDMAEN);
        LL_SPI_Enable(instance);
        LL_SPI_StartMasterTransfer(instance);
        return;
    }
#endif

#if !defined(STM32G4) && !defined(STM32H7)
    if (dmaRx) {
#endif
        // Use the correct callback argument
        dmaRx->userParam = (uint32_t)dev;

        // Clear transfer flags
        DMA_CLEAR_FLAG(dmaTx, DMA_IT_HTIF | DMA_IT_TEIF | DMA_IT_TCIF);
        DMA_CLEAR_FLAG(dmaRx, DMA_IT_HTIF | DMA_IT_TEIF | DMA_IT_TCIF);

#ifdef STM32G4
        // Disable channels to enable update
        LL_DMA_DisableChannel(dmaTx->dma, dmaTx->stream);
        LL_DMA_DisableChannel(dmaRx->dma, dmaRx->stream);

        /* Use the Rx interrupt as this occurs once the SPI operation is complete whereas the Tx interrupt
         * occurs earlier when the Tx FIFO is empty, but the SPI operation is still in progress
         */
        LL_DMA_EnableIT_TC(dmaRx->dma, dmaRx->stream);

        // Update channels
        LL_DMA_Init(dmaTx->dma, dmaTx->stream, bus->dmaInitTx);
        LL_DMA_Init(dmaRx->dma, dmaRx->stream, bus->dmaInitRx);

        // Enable channels
        LL_DMA_EnableChannel(dmaTx->dma, dmaTx->stream);
        LL_DMA_EnableChannel(dmaRx->dma, dmaRx->stream);

        SET_BIT(instance->CR2, SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN);
#else
        DMA_Stream_TypeDef *streamRegsTx = (DMA_Stream_TypeDef *)dmaTx->ref;
        DMA_Stream_TypeDef *streamRegsRx = (DMA_Stream_TypeDef *)dmaRx->ref;

        // Disable streams to enable update
        LL_DMA_WriteReg(streamRegsTx, CR, 0U);
        LL_DMA_WriteReg(streamRegsRx, CR, 0U);

        /* Use the Rx interrupt as this occurs once the SPI operation is complete whereas the Tx interrupt
         * occurs earlier when the Tx FIFO is empty, but the SPI operation is still in progress
         */
        LL_EX_DMA_EnableIT_TC(streamRegsRx);

        // Update streams
        LL_DMA_Init(dmaTx->dma, dmaTx->stream, bus->dmaInitTx);
        LL_DMA_Init(dmaRx->dma, dmaRx->stream, bus->dmaInitRx);

